name = input()

has_B = 'Б' in name
has_la_li = not 'ла' in name and not 'ли' in name
has_na_ni = not 'ня' in name and not 'ни' in name

if has_B and has_la_li and has_na_ni and name < 'Бонд':
    print(name)
else:
    print('Не подходит!')

# Мне подарили щенка! И сказали, что ему нужно придумать имя. 
# Оно обязательно должно начинаться на Б, не должно содержать «ла» и «ли», «ня» и «ни».
#  А ещё хорошо бы, чтобы имя шло по алфавиту раньше имени Бонд.

# Если придуманное имя подходит, то выведите это имя, если нет, то
# Не подходит!