num = int(input())

if num // 10000 % 2 == 0 and num // 1000 % 10 % 2 == 0 and \
    num // 100 % 10 % 2 == 0 and num // 10 % 10 % 2 == 0 and\
        num % 10 % 2 == 0:
    print('True')
else:
    print('False')

# Напишите программу, которая проверяет, являются ли все цифры введённого пятизначного числа чётными. Постарайтесь записать проверку в одну строку (возможно, с переносом строки кода).

# Формат ввода
# Вводится пятизначное число.

# Формат вывода
# Выведите True, если все цифры числа чётные, и False, если чётные не все.