user_input = input()

has_candy = 'конфет' in user_input
has_book = 'книг' in user_input 
has_bike = 'велосипед' in user_input or 'самокат' in user_input

if has_candy and has_book and has_bike:
    print('Вот хорошо!')
else:
    print('Не все.')




# Мама считает, что дарить мне конфеты — плохо. Лучше подарить книгу. Папа согласен, что получить в подарок велосипед или самокат — это здорово!
#  А я думаю, что хорошо бы получить и конфеты (а лучше набор конфет, ну или хотя бы одну конфету), и книгу или книги в любой форме, и велосипед или самокат.

# Напишите программу, которая проверит, есть ли все желаемые подарки во введённой строке. Если есть все, то выведите:
# Вот хорошо!

# Если не все, то выведите:
# Не все.