border_one = int(input())
border_two = int(input())
num = int(input())

low = min(border_one, border_two)
top = max(border_one, border_two)

if num < low:
    print('ниже')
elif num > low and num < top:
    print('внутри')
elif num > top:
    print('выше')
else:
    print('граница')

# Напишите программу для проверки попадания числа в некоторый диапазон.

# Формат ввода
# Вводятся два числа — границы диапазона в произвольном порядке. Затем вводится число для проверки.

# Формат вывода
# Определите, где находится введённое число — ниже нижнего, выше верхнего, внутри диапазона или на какой-либо границе. И выведите соответственно:

# ниже, выше, внутри, граница

