num = int(input())

if num % 3 == 0 and num % 5 == 0:
    print('отличное')
elif num % 5 == 0:
    print('полукруглое')
elif num % 3 == 0:
    print('тройное')
else:
    print('просто число')

# Назовём число отличным, если оно делится на 3 и 5. Если только на 5, то назовём его полукруглым. Если только на 3, то тройным, а если не кратно ни 3, ни 5, то пусть будет просто числом.

# Напишите программу, которая выведет название числа (отличное, полукруглое, тройное или просто число) в зависимости от его кратности.

